	

!
"
#
$
%
&
'
(
)
*
+
,
-
.
/
0
1
2
3
4
5
6
7
8
9
:
;
<
=
>
?
@
A
B
C
D
E
F
G
H
I
J
K
L
M
N
O
P
Q
R
S
T
U
V
W
X
Y
Z
[
]
^
_
`
a
b
c
d
e
f
g
h
i
j
k
l
m
n
o
p
q
r
s
t
u
v
w
x
y
z
{
|
}
~
£
¥
§
°
±
µ
¼
½
Ç
Ö
×
à
á
ä
ç
è
é
í
ñ
÷
ı
š
ˆ
̂
Δ
Σ
Ψ
α
β
γ
δ
ε
θ
λ
π
ρ
σ
φ
ं
ए
क
ग
च
ट
न
प
फ
ब
भ
म
य
र
ल
व
श
स
ा
ि
ी
ु
े
ै
ो
्
 
–
—
‘
’
“
”
„
‟
†
‡
•
…
€
₹
∆
∈
∑
−
∗
√
≠
≤
⊗
●








ﬁ
ﬂ
�
𝐿
𝑁
𝑋
𝑓
𝑖
𝑡
𝜂
𝜆
𝜉
𝜋
in
t
a
on
er
he
re
in
the
ti
en
p
c
o
s
ed
es
nd
ar
al
b
of
ing
f
ro
an
or
tion
it
ent
at
ic
d
m
is
ec
and
to
re
as
w
2
ur
e
ation
ve
om
g
20
h
et
il
l
th
per
ly
(
r
ver
st
I
ou
T
con
ow
cent
ment
ol
th
ect
ac
fl
ig
ex
A
ate
ain
on
n
od
ter
ut
id
u
for
ce
The
by
ity
im
ric
em
flation
1
row
le
as
el
C
is
S
ith
qu
pro
inflation
ad
uc
st
res
lo
R
be
rowth
ary
pric
M
ank
growth
with
200
ab
su
201
ge
se
igh
exp
su
ac
ts
B
inc
and
ear
uring
ri
rom
im
y
ion
from
al
ber
imp
com
G
ci
F
ch
de
mon
econ
ir
est
reas
olic
prices
mar
tive
ore
ul
sh
olicy
pp
v
ay
ust
ess
ated
at
ket
nt
cont
).
increas
tions
ort
end
tic
wh
over
ind
D
ot
In
red
act
Q
has
duc
it
ood
during
J
P
policy
an
market
20
rou
ates
that
ere
are
ap
year
O
ill
econom
E
3
ave
rec
dec
rate
ff
rem
U
os
tr
out
so
art
ud
was
remain
have
ris
li
N
able
ak
ance
high
cial
lin
econom
us
ep
bas
bal
um
Bank
ld
bank
5
ector
Ind
ign
ad
up
ther
4
res
lobal
all
202
age
ag
ember
ure
ven
dem
expect
inan
W
low
ies
ard
ew
if
ments
ations
ue
demand
over
etary
erve
gh
ount
global
Res
H
erv
un
ant
comp
US
ever
ans
sector
vi
un
also
to
Indi
ich
acc
ould
mod
mer
ks
pr
ight
ong
Ch
quid
6
le
inancial
Reserve
supp
quidity
inter
ost
me
qu
our
which
ous
di
ast
produc
anu
ab
ally
food
get
we
-
own
ties
Chart
ke
nder
declin
2008
ile
overn
mp
rep
PI
liquidity
indic
pre
7
ative
sp
pril
ati
been
ist
banks
omes
inv
ome
urre
arter
arch
under
monetary
financial
ove
contin
he
low
April
pres
V
redit
ag
Th
ug
price
omestic
anc
en
ex
cap
up
ail
increase
ence
ervic
ps
vel
II
than
overnment
owever
tim
moder
rates
its
condi
ide
am
cor
invest
ange
ept
increased
orts
quarter
curre
level
oc
higher
so
tain
ell
ors
India
sign
ch
ised
ward
orm
cro
L
credit
ib
2009
ding
sub
resp
ervices
se
po
conditions
ok
2007
eff
domestic
sur
dep
eptember
iod
this
consu
illion
pressu
oil
ital
cons
remained
uly
period
ility
aj
lud
will
markets
month
not
tiv
rough
cer
mod
basis
ating
impro
fir
round
es
ugust
ince
ade
ru
ds
put
ers
),
DP
March
ities
ss
eb
services
ational
flect
continu
8
une
were
urn
10
poin
proj
impact
account
ific
ening
non
erm
urther
some
tivity
fore
CPI
ures
per
expected
other
July
due
cal
fu
ral
ted
GDP
str
ne
there
reflect
enti
–
supply
crore
capital
look
economy
risks
or
tern
lar
cr
ro
while
investment
end
down
pressures
activity
September
lower
ved
cto
ctober
aver
repo
trans
ving
bo
app
ects
nc
ari
2010
fact
di
meas
ective
osit
ross
ural
ture
bps
St
production
their
les
since
als
sion
billion
10
expectations
19
ack
reg
0
anufact
por
iel
uch
recover
out
ebru
ebruary
dis
through
ee
9
fic
ajor
slow
October
Es
ang
lic
ough
vol
econd
further
major
ata
fter
term
ace
August
economic
current
ificant
however
anuary
pos
decline
til
main
ased
but
indust
ecember
large
could
points
June
rel
vey
recent
outlook
oll
may
cost
riv
luding
ass
yiel
As
arget
average
ra
significant
rib
manufact
ft
gin
ude
shar
line
target
man
ub
months
more
are
00
vious
weak
vis
ared
ened
ending
rec
inﬂ
February
pl
ime
ual
previous
ected
well
net
January
iscal
pr
li
ution
trade
mption
adline
Ac
government
lop
estim
form
hed
real
am
ise
year
sharp
would
into
mit
isation
ine
rivate
On
ase
pers
tit
deposit
ress
par
interest
recovery
velop
This
bet
fact
commod
i
BI
2011
gg
issu
III
PC
IV
ive
ection
contr
Table
lo
output
Ex
ke
2012
ability
the
ey
intern
change
endit
exc
defic
arly
202
ses
second
declined
like
these
certain
measures
Com
crude
both
support
again
economies
yst
all
first
ry
fiscal
reduc
we
11
Re
rial
such
volati
term
ances
risk
continued
respon
ach
Government
enditure
bal
ote
ruc
consumption
last
around
above
exports
ystem
old
about
12
ord
ory
vi
turn
uncertain
eri
2022
vari
meet
international
ections
ation
dri
December
vid
side
strong
manufacturing
ick
compared
headline
2020
ternal
ener
Mon
iness
good
Rs
rowing
resu
adv
verse
time
eler
soft
`
wor
stain
private
hile
deficit
data
tw
May
down
ra
edi
ax
Con
ows
Indian
2019
ann
sustain
revi
sc
survey
just
oment
deceler
usiness
ricul
improve
remains
fuel
develop
system
2021
equ
omentum
MPC
tical
commodity
expenditure
However
13
ovem
ovember
:
25
meeting
pl
reflecting
sugg
ries
bel
enc
momentum
ound
2023
corpor
exchange
against
bu
after
stance
resul
consumer
read
ween
gener
ﬁ
products
VI
ass
ago
levels
uted
ging
asing
road
18
foreign
goods
RBI
Ch
2024
reg
money
posi
ason
While
ix
moderation
ncy
ree
had
reci
ting
ock
ecur
EM
Cent
$
need
index
vail
anding
25
ording
below
long
likely
two
oli
pon
overall
ite
import
2013
ocks
bon
ness
far
count
forward
between
set
ems
external
oper
flow
norm
ables
tight
back
ollow
ve
2006
industrial
persist
ublic
ators
ential
ame
ible
firm
short
alf
deb
du
new
vers
Acc
udget
Pro
ath
anced
ext
oing
sal
AF
It
margin
co
estimates
12
ents
bor
mercial
one
rain
fore
central
yields
emer
tural
cern
broad
op
respective
av
Monetary
k
contrib
business
fac
moderated
mo
record
fall
ning
agg
Bs
ret
rise
factors
19
Policy
mat
op
vision
ider
view
ty
ia
half
sa
nds
eci
effects
ces
rop
follow
pick
imports
debt
November
lity
acro
sp
can
atio
even
anies
concern
ouse
ecurities
across
respon
con
inf
09
adjust
soon
ake
roup
upee
15
part
indicators
continue
lev
accom
ler
ured
tax
tre
ar
oun
volatility
March
With
pur
cut
ens
monsoon
correspon
mis
iz
fr
ip
50
rising
cip
etro
ev
forec
cess
whe
slowdown
head
macro
companies
agricul
qui
11
ord
int
its
respectively
bec
ages
based
loans
economic
terms
conduc
action
ister
though
ash
sequ
mainly
24
mitt
cent
ged
sectors
corresponding
flows
driven
au
ollar
loy
mission
sever
ng
According
iti
agement
public
ahead
14
.,
projected
aggreg
ater
ffer
borrowing
show
sales
There
dollar
clo
08
gative
positive
consider
improved
ticul
accommod
rose
asset
requi
off
State
years
ading
normal
ste
input
ansion
14
el
andem
round
Dr
rupee
corporate
Central
21
uation
commercial
rect
flows
EMEs
elev
ines
ext
prim
23
core
Note
min
wards
anged
stre
conf
pace
expansion
Inflation
2018
house
‘
base
ratio
mon
rest
gu
ounc
range
acity
items
sequent
elevated
const
securities
LAF
13
easing
Al
standing
2017
pos
peci
aking
17
currency
deposits
LR
costs
yc
petro
relative
ited
ient
though
aff
particul
stit
ish
till
suggest
negative
WPI
reven
esp
lement
streng
val
improvement
22
macroeconomic
equity
mittee
me
tot
uncertainty
three
16
assess
plus
seg
ructure
keep
should
idence
During
shocks
rast
ork
total
balance
emerging
17
effect
avail
pass
fin
lending
pecially
food
ii
led
18
ob
inflationary
sl
season
Sour
istered
spread
medi
iven
key
most
weight
countries
rastructure
andemic
Sh
significantly
tional
ger
especially
espite
gy
met
ird
ising
several
Committee
RR
management
unch
K
aggregate
ticip
excluding
surplus
unchanged
2016
developments
acce
port
ided
projections
advanced
still
sustained
order
rural
veget
det
hand
30
pul
prosp
same
househ
emp
eline
pay
ID
area
ounced
rad
Y
ed
purch
anges
j
ben
recorded
yield
including
concerns
uro
vised
being
report
gre
August
form
olitical
avour
coll
response
rel
prospects
dur
olution
infrastructure
capacity
add
ear
iron
ays
move
prog
ten
budget
one
ism
gross
side
har
gain
depreci
baseline
bust
val
16
reflected
percent
guid
ixed
if
various
banking
15
dued
FC
amount
tightening
near
bond
cies
contraction
revenue
within
MI
pot
ession
acceler
confidence
funds
trend
September
loyment
man
only
struc
abs
month
reduction
prof
Global
oy
senti
based
robust
lim
ency
addi
ituation
cash
raised
sharply
subdued
itness
differ
increases
CBs
provid
four
state
An
OV
witness
aster
world
led
OVID
inflation
export
transmission
cyc
conducted
stability
adverse
ced
quarters
dist
cep
raw
reserv
Fed
changes
31
particularly
share
ring
akh
ied
ice
includ
conom
ge
abil
atis
largely
leum
ause
ousing
Econom
lier
maintain
announced
gap
following
moderate
sure
sions
each
strengthe
perform
contain
ute
ie
urb
Un
situation
operations
ina
rup
hel
early
MS
These
isis
ical
util
stock
important
fut
lakh
spending
change
07
fre
ended
ajector
hib
us
they
ined
ower
ily
For
000
now
bar
trajector
require
upside
deceleration
auc
22
fall
medium
assessment
olds
indicate
aily
reduced
inflows
eased
help
effective
2014
Exp
inst
pressure
although
increasing
path
ked
general
COVID
reverse
hard
performance
turned
cl
Sur
rece
viron
review
vironment
Bo
favour
decelerated
sm
ves
2015
revised
primary
exhib
any
AD
China
Over
witnessed
VA
2019
before
ose
gan
pe
environment
mid
vest
daily
indicates
unc
anti
pandemic
with
aff
num
50
when
percentage
poss
sour
initi
ecess
trajectory
call
group
start
June
petroleum
De
aken
softening
disc
rain
Net
ble
war
close
process
necess
compon
set
sequently
potential
day
crisis
harif
of
towards
Out
aced
ibility
implement
registered
housing
hi
Accordingly
less
grad
II
case
Survey
subst
uled
propos
omin
Mar
Ad
number
MF
accommodative
Growth
att
substanti
constit
matur
given
staff
27
transport
do
retail
assu
resh
olid
outh
24
point
available
weighted
contract
evol
21
downside
elines
Ag
agriculture
Am
volatile
vote
wid
Since
rele
elect
emp
decided
issued
ott
ow
no
night
buoy
aper
bonds
Fir
EC
ests
excess
past
regul
vegetables
result
prov
despite
AEs
pulses
mar
assets
cal
Indust
og
Economic
revival
ases
earlier
utilisation
Rate
along
23
appro
tick
Banks
provide
min
signs
abour
ision
erch
lying
reserve
fer
ram
resolution
Source
actions
kharif
Jap
Japan
Statement
comm
volum
port
regard
med
Non
projection
100
absor
“
finan
marginally
very
PMI
cing
third
26
power
heduled
fell
Further
begin
28
dou
*
return
VII
adjusted
borrowings
ergy
future
agricultural
going
facility
ably
December
aged
ind
optim
appreci
revision
Cap
structural
consolid
ha
way
payments
inj
guidelines
ition
hat
tensions
vis
formation
households
Not
Tr
better
continues
ather
instit
allow
45
bank
Second
firms
omm
view
enari
2023
2020
First
expand
ful
foli
Domestic
eed
29
utions
reserves
Index
erchand
disrup
ush
2018
Li
oring
erchandise
favourable
subs
ants
gold
ework
million
segment
fram
post
forecast
contributed
balances
correc
air
movements
ocus
ai
next
ressed
improving
direct
roups
ech
Act
duce
energy
ruction
seen
Among
income
National
allen
Pric
timul
comb
whol
ricity
challen
Prof
ize
aly
ent
industry
evid
75
proposed
Financial
uncertainties
focus
budgeted
where
Fore
Food
bound
Overall
CRR
appear
ner
euro
ned
stimul
boost
suggests
moved
umul
Dep
hem
fixed
los
scenari
Fu
small
constrain
beginning
Credit
ful
model
peak
ce
supported
necessary
scal
act
istent
buil
inc
ensure
sw
vities
Budget
At
tivities
cover
placed
rid
Consu
labour
double
Review
line
abi
ipts
showed
remaining
wee
value
folio
materi
yn
surveys
Group
evolving
Imp
framework
iesel
lat
sell
Govern
indicated
utive
resil
context
auctions
exhibited
NR
upward
IMF
Data
modest
member
ecutive
revers
withstanding
rated
sour
saving
ropri
idst
rainfall
mob
#
made
diesel
frequ
May
lead
ination
DI
cycle
durable
sentiment
ropriate
int
ron
softened
essional
fron
ceed
draw
recomm
urban
Qu
Market
therefore
barrel
SE
measured
medi
ach
achie
oil
much
iﬁ
SO
scheduled
More
40
ises
be
country
Deb
Gross
roduc
appropriate
through
adop
experi
sec
facil
cer
hic
resour
accommodation
opolitical
GVA
fund
ually
stead
depreciation
36
indices
z
chmar
progress
hes
relatively
usion
ancial
respond
issues
's
shif
activities
(-
repres
implementation
2021
partly
withdraw
irect
anticip
del
include
car
bi
estimated
2022
onal
enh
fort
those
arily
subsid
ph
provision
maturity
ncies
segments
unic
dig
ll
cle
few
alth
investments
Rs
contracted
respect
underlying
advance
accelerated
place
persistent
ST
currencies
umulative
work
generally
ateg
Industrial
aus
broadly
nes
istic
ored
Curre
needs
omew
July
anch
urban
ented
&
imum
Inc
ounts
investors
action
Es
olicies
basket
six
declining
states
offset
somew
ateral
acc
information
States
ues
gence
ges
amidst
CR
2024
char
front
atives
Going
ton
stocks
use
additional
expanded
Although
somewhat
serv
results
portfolio
rabi
amic
taken
annual
fl
aded
Estim
vehic
atory
mitted
adjustment
eries
ready
ynamic
inﬂation
igures
Union
consolidation
ills
TL
instru
geopolitical
gar
hest
High
reduce
eral
less
because
34
limit
mul
cere
aging
contribution
longer
extent
lag
downward
February
industries
asts
financing
benchmar
CB
already
ian
aug
decision
her
get
final
ounce
stable
she
manufactured
oming
Rec
sources
Services
marginal
continuing
prot
fresh
signiﬁ
employment
disruptions
grew
tem
ale
shows
comfort
picked
size
frequency
rains
Ps
corporates
ffic
our
lied
go
restric
components
stand
MO
Consumer
merchandise
cumulative
admin
Liquidity
ulation
observ
started
tonnes
preced
after
outc
ribution
ighest
ef
dynamic
suc
orpor
arent
uss
by
commodities
consecutive
pped
vestment
Capital
consistent
urop
ecting
deflation
greater
def
ternational
abilities
DTL
cuts
off
urope
become
alys
illo
Outlook
among
ories
slowing
gains
warr
asters
electricity
personal
rior
sheet
After
prem
enced
highest
particip
lex
ality
announce
policies
owing
reﬂ
BFC
forecasts
preceding
indicative
International
cur
communic
health
mobil
stimulus
my
crops
heme
Develop
withdrawal
till
Europe
verage
indicating
diver
amp
CAD
released
mediate
ration
ights
rebound
He
construction
shock
est
er
Work
Quarter
ref
iv
provided
outstanding
observed
undert
Sources
);
obj
wage
optimism
multi
faster
cant
steel
categ
program
adopted
 
space
success
slowed
Figures
followed
nar
monit
equ
scenario
₹
Agricul
April
receipts
benchmark
keeping
many
weakening
otal
chain
ery
primarily
areas
requirements
outflows
nomin
coal
cc
foodg
Man
issuances
ature
volume
reported
deﬁ
ayed
mental
Exchange
mil
introduc
purchases
petrol
contrast
To
prob
certain
ane
Min
Centre
Shri
Co
olding
MS
instruments
hen
sowing
ustom
pat
ult
Euro
actual
days
imil
relating
take
disinflation
32
household
Taking
institutions
orld
tim
alysis
finance
loc
addition
possible
series
ming
itory
impacted
spillo
atistical
moderating
for
raw
supporting
leading
wheat
reasur
actions
overnight
60
Moreover
persistence
cereals
recommend
kes
stronger
enti
risen
We
align
pricing
FY
Estimates
sh
CI
more
nual
ounter
strengthening
Foreign
ticles
reform
echn
correction
win
responses
ump
Consequently
ancing
spreads
ecific
cre
rice
band
US
build
oking
muted
oper
trends
related
utral
South
ervice
ified
FDI
sugar
encies
ished
parent
occ
World
(-)
paper
Even
enter
present
stress
growing
face
erior
falling
CPI
ﬂ
distribution
excep
caus
calib
isting
Working
five
hike
implic
soci
Despite
overe
overeign
sentiments
Third
35
around
seasonal
ption
then
full
br
spi
Or
reasury
taking
BFCs
extended
projects
communication
aut
gradually
ling
eds
them
prior
Real
factor
constraints
approach
WA
prevail
dynamics
most
Annual
groups
PR
bring
open
heses
exceed
ering
oils
height
deterior
statement
week
Fin
held
ourse
pattern
Section
metals
ease
uty
affected
uptick
minimum
Furthermore
tempor
Russ
et
ense
appears
constituted
recession
Private
IIP
GST
foodgrains
parentheses
sel
care
entially
substantially
added
wages
+
selling
combined
esale
product
sequ
fourth
dr
sum
financial
itig
vegetable
nancial
AR
SCBs
pose
resulted
75
substantial
ugg
objective
firmed
ived
push
ject
els
savings
resources
suring
custom
Instit
ond
ER
reason
anticipated
Governments
ached
mitig
toler
atistic
traff
traffic
collections
Inter
tioned
put
Given
kept
invent
Headline
ann
facilit
quarterly
quality
cri
used
hist
analysis
otton
ensuring
stabil
steady
clos
going
weakened
neutral
retain
eman
announcement
Bo
material
November
injection
edible
adequ
DEs
seeds
turnaround
viz
SLR
articles
employment
intens
measure
day
required
pper
ridor
70
clear
prin
saf
Le
ete
ately
Money
raz
tolerance
Manufact
irc
recommendations
programme
razil
warrant
hardening
different
agers
estate
passen
depend
curve
infl
margins
yet
DS
thor
drivers
sli
professional
ial
slack
cit
latest
liabilities
26
using
step
RA
EM
utual
FII
Sector
without
Corpor
MSS
com
Brazil
37
All
formation
Other
Investment
Rep
Chair
bs
address
thereafter
gradual
34
Average
regulatory
sovereign
almost
buoyant
profit
ror
part
Ass
Based
agn
hor
If
lusion
utes
El
cement
other
uthor
reach
UK
implications
corridor
nominal
chem
expo
uggish
cluding
mple
ously
oilseeds
30
Deposit
accounts
Total
run
calibrated
Agriculture
agencies
cou
sation
coming
prises
ides
normalisation
transactions
stat
lical
Sc
maintained
33
lin
heightened
revisions
impart
atch
role
acceleration
holding
wave
subsidies
sluggish
absorption
critical
trading
helped
oot
larger
ighted
guidance
ator
resilient
percep
verages
fort
pertain
administered
beverages
vot
39
Business
counter
collateral
